<h1 class="titel">Урок 3. Циклы и массивы.</h1>
<section>
    <h2>Задание 1</h2>
    <p>С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.</p>
    <h2>Решение</h2>
    <?php
    $num = 0;
    while ($num <= 100) {
        if($num % 3 == 0)
            echo "$num ";
        $num++;
    }
    ?>
</section><hr>

<section>
    <h2>Задание 2</h2>
    <p>С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:</p>
    <p>0 – ноль.</p>
    <p>1 – нечетное число.</p>
    <p>2 – четное число.</p>
    <p>3 – нечетное число.</p>
    <p>...</p>
    <p>10 – четное число.</p>
    <h2>Решение</h2>
    <?php
    $num =0;
    do {
        if($num == 0) {
            echo $num." - это ноль.<br>";
        }
        elseif($num % 2 == 0) {
            echo $num." - четное число.<br>";
        }
        else {
            echo $num. " - нечетное число.<br>";
        }
        $num++;
    }
    while ($num <= 10);
    ?>
</section><hr>

<section>
    <h2>Задание 3</h2>
    <p>Объявить массив, в котором в качестве ключей будут использоваться названия областей, а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:</p>
    <p>Московская область: Москва, Зеленоград, Клин</p>
    <p>Ленинградская область: Санкт-Петербург, Всеволожск, Павловск, Кронштадт</p>
    <p>Рязанская область … (названия городов можно найти на maps.yandex.ru)</p>
    <h2>Решение</h2>
    <?php
    $areas = [
        "Московская область" => ['Москва', 'Зеленоград', 'Клин', 'Коломна'],
        "Ленинградская область" => ['Санкт-Петербург', 'Всеволожск', 'Павловск','Кронштадт'],
        "Рязанская область" => ['Рязань', 'Шацк', 'Сасово','Шилово','Касимов'],
        "Республика Коми" => ['Сыктывкар', 'Усинск', 'Воркута']
    ];
    function outputArray($areas){
        foreach ($areas as $region => $city) {
            echo $region . ': ';
            $size = sizeof($city);//подсчитаем количество элементов в массиве
            $i = 0;
            while ($i < $size-1) {
                echo "$city[$i], ";
                $i++;
            }
            echo $city[$size-1].". <br>";
    }
    }
    outputArray($areas);
    ?>
</section><hr>

<section>
    <h2>Задание 4</h2>
    <p>Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’). Написать функцию транслитерации строк.</p>
    <h2>Решение</h2>
    <?php
    function transliteration($text) {
        $alphabet = [
            "а"=>"a", "б"=>"b", "в"=>"v", "г"=>"g", "д"=>"d", "е"=>"e", "ё"=>"e", "ж"=>"zh", "з"=>"z", "и"=>"i",
            "й"=>"i", "к"=>"k", "л"=>"l", "м"=>"m", "н"=>"n", "о"=>"o", "п"=>"p", "р"=>"r", "с"=>"s", "т"=>"t",
            "у"=>"u", "ф"=>"f", "х"=>"h", "ц"=>"tc", "ч"=>"ch", "ш"=>"sh", "щ"=>"shch", "ы"=>"y", "э"=>"e", "ю"=>"yu",
            "я"=>"ya", "ь"=>"", "ъ"=>"",
            "А"=>"A", "Б"=>"B", "В"=>"V", "Г"=>"G", "Д"=>"D", "Е"=>"E", "Ё"=>"E", "Ж"=>"Zh", "З"=>"Z", "И"=>"I",
            "Й"=>"I", "К"=>"K", "Л"=>"L", "М"=>"M", "Н"=>"N", "О"=>"O", "П"=>"P", "Р"=>"R", "С"=>"S", "Т"=>"T",
            "У"=>"U", "Ф"=>"F", "Х"=>"H", "Ц"=>"Tc", "Ч"=>"Ch", "Ш"=>"Sh", "Щ"=>"Shch", "Ы"=>"Y", "Э"=>"E", "Ю"=>"Yu",
            "Я"=>"Ya", "Ь"=>"", "Ъ"=>""
            ];
        return strtr($text, $alphabet); //Преобразует заданные символы или заменяет подстроки
    }
    echo transliteration("Объявить массив, индексами которого являются буквы русского языка, а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’). Написать функцию транслитерации строк.");
    ?>
</section><hr>

<section>
    <h2>Задание 5</h2>
    <p>Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.</p>
    <h2>Решение</h2>
    <?php
    function replacingSpaces($text){
        return preg_replace('/\s/',  '_', $text); //Выполняет поиск и замену по регулярному выражению
    }
    echo replacingSpaces('Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.');
    ?>
</section><hr>

<section>
    <h2>Задание 6</h2>
    <p>В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое через PHP. Необходимо представить пункты меню как элементы массива и вывести их циклом. Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.</p>
    <h2>Решение</h2>
    <?php
$menu = [
    'Главная страница' =>'http://infostorage.ru',
    'Рубрики'=>['HTML' => 'https://webref.ru/html', 'CSS' =>'https://webref.ru/css', 'PHP'=>'https://metanit.com/web/php/']
    ];
    function getMenu($menu){
        $rendMenu = '<ul>';
        foreach ($menu as $key => $val) {
            //если имеется вложенный массив
            if (is_array($val)) {
                $rendMenu .= "<li><a href='#'>".$key.getMenu($val)."</a></li>";
            } else {
                $rendMenu .= "<li><a href='$val'>".$key."</a></li>";
            }
        }
        $rendMenu .= '</ul>';

        return $rendMenu;
    }
    echo getMenu($menu);
    ?>
</section><hr>

<section>
    <h2>Задание 7</h2>
    <p>Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла. То есть выглядеть должно так</p>
    <h2>Решение</h2>
    <div class="code-wrap">
        <code>for($i=0; $i <= 9; print_r($i++." "))</code>
    </div>
    <?php
    for($i=0; $i <= 9; print_r($i++." "))
    ?>
</section><hr>

<section>
    <h2>Задание 8</h2>
    <p>*Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».</p>
    <h2>Решение</h2>
    <?php
    $newAreas =[];
    foreach ($areas as $region => $city) {
        $i=0;
        //обнуляем массив в новыми городами
        $newCity =[];
        foreach ($city as $key => $val) {
            if (substr($val,0,2) == 'К') { // Возвращает подстроку строки string, начинающейся с К
                //добавим найденные элементы в новый массив и увеличим итератор
                $newCity[$i]=$val;
                $i++;
            }
        }
        //проверим на наличие элементов внутри массива новых городов и если он не пустой добавляем в новый массив регионов
        if($newCity): $newAreas[$region] = $newCity; endif;
    }
    outputArray($newAreas);
    ?>
</section><hr>

<section>
    <h2>Задание 9</h2>
    <p>*Объединить две ранее написанные функции в одну, которая получает строку на русском языке, производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).</p>
    <h2>Решение</h2>
    <?php
    function transliterationReplacingSpaces($text) {
        $alphabet = [
            "а"=>"a", "б"=>"b", "в"=>"v", "г"=>"g", "д"=>"d", "е"=>"e", "ё"=>"e", "ж"=>"zh", "з"=>"z", "и"=>"i",
            "й"=>"i", "к"=>"k", "л"=>"l", "м"=>"m", "н"=>"n", "о"=>"o", "п"=>"p", "р"=>"r", "с"=>"s", "т"=>"t",
            "у"=>"u", "ф"=>"f", "х"=>"h", "ц"=>"tc", "ч"=>"ch", "ш"=>"sh", "щ"=>"shch", "ы"=>"y", "э"=>"e", "ю"=>"yu",
            "я"=>"ya", "ь"=>"", "ъ"=>"",
            "А"=>"A", "Б"=>"B", "В"=>"V", "Г"=>"G", "Д"=>"D", "Е"=>"E", "Ё"=>"E", "Ж"=>"Zh", "З"=>"Z", "И"=>"I",
            "Й"=>"I", "К"=>"K", "Л"=>"L", "М"=>"M", "Н"=>"N", "О"=>"O", "П"=>"P", "Р"=>"R", "С"=>"S", "Т"=>"T",
            "У"=>"U", "Ф"=>"F", "Х"=>"H", "Ц"=>"Tc", "Ч"=>"Ch", "Ш"=>"Sh", "Щ"=>"Shch", "Ы"=>"Y", "Э"=>"E", "Ю"=>"Yu",
            "Я"=>"Ya", "Ь"=>"", "Ъ"=>""
        ];
        return strtr(preg_replace('/\s/',  '_', $text), $alphabet);
    }
    echo transliterationReplacingSpaces("Объ&shy;еди&shy;нить две ра&shy;нее на&shy;пи&shy;сан&shy;ные функ&shy;ции в од&shy;ну, ко&shy;то&shy;рая по&shy;лу&shy;ча&shy;ет стро&shy;ку на рус&shy;ском язы&shy;ке, про&shy;из&shy;во&shy;дит транс&shy;ли&shy;те&shy;ра&shy;цию и за&shy;ме&shy;ну про&shy;бе&shy;лов на под&shy;чер&shy;ки&shy;ва&shy;ния (ана&shy;ло&shy;гич&shy;ная за&shy;да&shy;ча ре&shy;ша&shy;ет&shy;ся при кон&shy;ст&shy;ру&shy;и&shy;ро&shy;ва&shy;нии url-ад&shy;ре&shy;сов на ос&shy;но&shy;ве на&shy;зва&shy;ния статьи в бло&shy;гах)");
    ?>
</section><hr>

<style type="text/css">
    * {
        width: 1024px;
        margin: 0 auto;
        background-color: #e6e7f6;
    }

    .titel{
        margin: 35px;
        text-align: center;
    }

    hr {
        margin: 25px 0;
    }

    h2 {
        margin: 10px 0;
    }

    p {
        margin: 10px 5px;
        text-align: justify-all;
    }

    code {
        margin: 0 25px;
    }

    .php {
        margin: 0;
    }

    .code-wrap {
        display: flex;
        flex-direction: column;
        margin: 5px 0;
    }

    .code-case-wrap{
        display: flex;
        flex-direction: column;
        margin: 0;
    }

    .code-case-wrap code{
        margin: 0 0 0 50px;
    }
</style>